{
  "meeting_id": "customer_feedback_2026_05_10",
  "title": "Customer Feedback Review - Enterprise Segment",
  "date": "2026-05-10",
  "duration_minutes": 60,
  "participants": ["Sarah Chen (VP Product)", "David Park (VP Sales)", "Grace Morgan (Customer Success)", "Alice Kim (Design)", "Tom Wilson (User Research)"],
  "transcript": "Sarah: Thanks for joining everyone. Tom's team finished the enterprise customer research study. Tom, take us through the findings.\n\nTom: We interviewed 15 enterprise customers and 8 prospects who didn't convert. I'll summarize the key themes.\n\nTom: First theme - security and compliance. 12 out of 15 customers mentioned security as their primary concern when evaluating us. The good news is our SOC 2 certification was a key differentiator. The concern is about data residency - European customers want EU-based data storage.\n\nSarah: That connects to our EMEA expansion plans. We'll need EU data centers before aggressive expansion.\n\nTom: Second theme - admin controls. Enterprise customers want more granular permissions. Specifically, they want role-based access control, audit logs of who did what, and the ability to restrict features by user group.\n\nGrace: I can add context there. Meridian Financial, one of our largest accounts, has asked for audit logs three times. They need it for their internal compliance.\n\nSarah: That's useful signal. Let me note that as a feature request.\n\nTom: Third theme - integration ecosystem. Every enterprise customer uses multiple tools. They want native integrations with Salesforce, Jira, Slack, and SSO providers.\n\nDavid: SSO has come up in almost every enterprise deal. It's table stakes for IT approval.\n\nSarah: We have SSO on the roadmap for Q3. Where is Salesforce integration?\n\nGrace: Not currently planned. It would be high effort.\n\nAlice: From a design perspective, we could do a lightweight Salesforce integration using their APIs. Doesn't have to be a full bidirectional sync.\n\nSarah: Good thinking. Let's explore a lightweight approach. Action item for Alice to mock up what a basic Salesforce integration would look like.\n\nTom: Fourth theme - customer success and support. Enterprise customers expect faster response times and dedicated support contacts. Current SLA is 24 hours, they want 4 hours.\n\nGrace: We don't have the team to support 4-hour SLA across all enterprise customers. Maybe for a premium tier?\n\nSarah: That's a pricing conversation. Let's earmark this for the pricing strategy review next month.\n\nTom: Fifth theme - onboarding and training. Larger customers want white-glove onboarding. They're willing to pay for it but we don't offer it.\n\nDavid: I've had prospects ask about professional services. There's definitely demand.\n\nSarah: This could be a revenue opportunity. Grace, can you draft what a professional services offering would look like?\n\nGrace: Happy to. Should I benchmark against competitors?\n\nSarah: Yes, see what Notion and Airtable charge for enterprise onboarding.\n\nTom: Those are the five main themes. I also have some specific feature requests I'll share in the detailed report.\n\nSarah: Thanks Tom. Let me synthesize what I'm hearing. Security and compliance is validated - our SOC 2 is working but we need EU data residency. Admin controls and audit logs are a gap we need to close. SSO is confirmed as must-have for enterprise. There's opportunity in professional services.\n\nDavid: One thing I want to highlight from the prospects who didn't convert. The number one reason was lack of API access. They wanted to build custom integrations.\n\nSarah: That aligns with our API beta. Once that's out, we should revisit those prospects.\n\nDavid: Already have a list ready to re-engage.\n\nSarah: Let's make some decisions. First, I'm going to prioritize audit logs for Q3. It keeps coming up and it's a compliance requirement.\n\nGrace: That would make several customers very happy.\n\nSarah: Second, we should accelerate the EU data residency planning. I'll work with Mike to understand the technical requirements.\n\nSarah: Third, we're going to create a professional services offering. Grace owns the proposal. Target is to have pricing ready by end of May.\n\nGrace: Got it.\n\nAlice: Question - should we do any design research on the admin controls? I don't want to design something without understanding the specific workflows.\n\nTom: Good point. I can arrange follow-up interviews with three customers who specifically requested admin controls.\n\nAlice: That would be perfect.\n\nSarah: Tom, set those up. Alice, hold off on admin control designs until you have that research.\n\nDavid: What's our message to enterprise prospects right now? What can I promise them?\n\nSarah: Payments launching May 15 - that's confirmed. SSO in Q3 - that's on the roadmap. Audit logs - tell them it's coming but don't commit to a date yet until I confirm with engineering. API beta is available now for select customers.\n\nDavid: That gives me enough to work with.\n\nSarah: Great meeting everyone. Action items: Alice on Salesforce integration concept, Grace on professional services proposal, Tom on admin control research interviews, I'll sync with Mike on EU data residency. Let's reconvene in two weeks to check progress."
}
